#include <iostream>
// shift+f5 (취소) f10 (다음 라인) f11(step into) f5(다음 브레이크 포인트)
// 조사식 : 계산도 가능 , 디버그-> 창 -> 조사식  (조사식에서 계싼하는 것은 자료형 영향 x)
// 호출스택에서 호출경로 확인
//ascii 65대문자 , 97소문자
// <<(곱하기 2) >>(나누기2) 시프트 
// 비트 연산자 & 논리곱
//음수표현 교재 24족 (2의 보수= 1의 보수에 1을 더한 것, 뺄셈에서 사용)
// clang_1 중요(포인터)

int main()
{
    std::cout << "Hello World!\n";
}

// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
